
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.2.294
# Date: 2025-07-12 12:23

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: T120F324
# Project: dct_uart
# Timing Model: C3 (final)

# PLL Constraints
#################
create_clock -period 16.668 -name clk [get_ports {clk}]

# GPIO Constraints
####################

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rx_pin}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rx_pin}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_tx_pin}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_tx_pin}]

# LVDS Rx Constraints
####################
